reran full ACC tests, the batch step appears to be failing before and after my changes so I assume it's unrelated? Happy to raise an issue if this is news.
```
$ TF_ACC=1 go test ./aws -v -count 1 -parallel 4 -run=TestAccAWSCloudWatchEventTarget_ -timeout 60m
=== RUN   TestAccAWSCloudWatchEventTarget_basic
=== PAUSE TestAccAWSCloudWatchEventTarget_basic
=== RUN   TestAccAWSCloudWatchEventTarget_missingTargetId
=== PAUSE TestAccAWSCloudWatchEventTarget_missingTargetId
=== RUN   TestAccAWSCloudWatchEventTarget_full
=== PAUSE TestAccAWSCloudWatchEventTarget_full
=== RUN   TestAccAWSCloudWatchEventTarget_ssmDocument
=== PAUSE TestAccAWSCloudWatchEventTarget_ssmDocument
=== RUN   TestAccAWSCloudWatchEventTarget_ecs
=== PAUSE TestAccAWSCloudWatchEventTarget_ecs
=== RUN   TestAccAWSCloudWatchEventTarget_ecsWithBlankTaskCount
=== PAUSE TestAccAWSCloudWatchEventTarget_ecsWithBlankTaskCount
=== RUN   TestAccAWSCloudWatchEventTarget_batch
=== PAUSE TestAccAWSCloudWatchEventTarget_batch
=== RUN   TestAccAWSCloudWatchEventTarget_kinesis
=== PAUSE TestAccAWSCloudWatchEventTarget_kinesis
=== RUN   TestAccAWSCloudWatchEventTarget_sqs
=== PAUSE TestAccAWSCloudWatchEventTarget_sqs
=== RUN   TestAccAWSCloudWatchEventTarget_input_transformer
=== PAUSE TestAccAWSCloudWatchEventTarget_input_transformer
=== CONT  TestAccAWSCloudWatchEventTarget_basic
=== CONT  TestAccAWSCloudWatchEventTarget_batch
=== CONT  TestAccAWSCloudWatchEventTarget_input_transformer
=== CONT  TestAccAWSCloudWatchEventTarget_sqs
--- PASS: TestAccAWSCloudWatchEventTarget_sqs (43.91s)
=== CONT  TestAccAWSCloudWatchEventTarget_kinesis
--- PASS: TestAccAWSCloudWatchEventTarget_basic (57.80s)
=== CONT  TestAccAWSCloudWatchEventTarget_ssmDocument
=== CONT  TestAccAWSCloudWatchEventTarget_batch
    resource_aws_cloudwatch_event_target_test.go:283: After applying this test step, the plan was not empty.
        stdout:


        An execution plan has been generated and is shown below.
        Resource actions are indicated with the following symbols:
          ~ update in-place
        -/+ destroy and then create replacement

        Terraform will perform the following actions:

          # aws_batch_job_definition.batch_job_definition must be replaced
        -/+ resource "aws_batch_job_definition" "batch_job_definition" {
              ~ arn                  = "arn:aws:batch:eu-west-1:887702914428:job-definition/tf_batch_target-5829695721356721392:1" -> (known after apply)
              ~ container_properties = jsonencode(
                  ~ {
                        command              = [
                            "ls",
                            "-la",
                        ]
                        environment          = []
                        image                = "busybox"
                        memory               = 512
                        mountPoints          = []
                      - resourceRequirements = [] -> null
                      - secrets              = [] -> null
                        ulimits              = []
                        vcpus                = 1
                        volumes              = []
                    }
                )
              ~ id                   = "arn:aws:batch:eu-west-1:887702914428:job-definition/tf_batch_target-5829695721356721392:1" -> (known after apply)
                name                 = "tf_batch_target-5829695721356721392"
              ~ revision             = 1 -> (known after apply)
                type                 = "container"
            }

          # aws_cloudwatch_event_target.test will be updated in-place
          ~ resource "aws_cloudwatch_event_target" "test" {
                arn       = "arn:aws:batch:eu-west-1:887702914428:job-queue/tf_batch_target-5829695721356721392"
                id        = "tf_batch_target-5829695721356721392-terraform-20201017154859657400000005"
                role_arn  = "arn:aws:iam::887702914428:role/event_tf_batch_target-5829695721356721392"
                rule      = "tf_batch_target-5829695721356721392"
                target_id = "terraform-20201017154859657400000005"

              ~ batch_target {
                    array_size     = 0
                    job_attempts   = 0
                  ~ job_definition = "arn:aws:batch:eu-west-1:887702914428:job-definition/tf_batch_target-5829695721356721392:1" -> (known after apply)
                    job_name       = "tf_batch_target-5829695721356721392"
                }
            }

        Plan: 1 to add, 1 to change, 1 to destroy.
--- PASS: TestAccAWSCloudWatchEventTarget_input_transformer (67.75s)
=== CONT  TestAccAWSCloudWatchEventTarget_ecsWithBlankTaskCount
--- PASS: TestAccAWSCloudWatchEventTarget_ssmDocument (23.40s)
=== CONT  TestAccAWSCloudWatchEventTarget_ecs
--- PASS: TestAccAWSCloudWatchEventTarget_ecsWithBlankTaskCount (36.55s)
=== CONT  TestAccAWSCloudWatchEventTarget_full
--- PASS: TestAccAWSCloudWatchEventTarget_kinesis (64.48s)
=== CONT  TestAccAWSCloudWatchEventTarget_missingTargetId
--- PASS: TestAccAWSCloudWatchEventTarget_ecs (32.22s)
--- PASS: TestAccAWSCloudWatchEventTarget_missingTargetId (19.91s)
--- PASS: TestAccAWSCloudWatchEventTarget_full (57.76s)
--- FAIL: TestAccAWSCloudWatchEventTarget_batch (167.33s)
FAIL
FAIL	github.com/terraform-providers/terraform-provider-aws/aws	170.132s
FAIL
```